The fitting that is converted to was not defined. Please load one fitting family and assign it in the routing preference.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NoFittingLoadedInProjectError { get; }
  Visual Basic
Public Shared ReadOnly Property NoFittingLoadedInProjectError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoFittingLoadedInProjectError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AutoRouteFailures Class
  Autodesk.Revit.DB Namespace